export default [{
  q: '돈은 무엇인가요? 신용화폐는 좋은 돈인가요?',
  a: `
    돈은\n1. 교환의 매개체 (medium of exchange)\n2. 가치 저장 수단 (store of value)\n3. 가치 측정 수단 (unit of account)\n입니다.

    신용화폐는 1, 3의 역할은 잘 수행하고 있지만, 2의 역할은 제대로 수행하고 있지 못합니다. 현재 인류가 가장 신뢰하고 있는 신용화폐인 달러도, 닉슨이 금본위제를 폐지한 1971년 이래로 90%의 구매력을 잃었습니다.

    <img src="https://www.visualcapitalist.com/wp-content/uploads/2021/03/Purchasing-Power-of-the-U.S.-Dollar-Over-Time.jpg">

    이는, 만약 당신이 1971년에 $10,000를 금고에 두고 지금까지 그대로 둔 상태라면, 현재 그 구매력은 그 당시 기준의 $1,000에 불과한 수준으로 줄어있다는 뜻입니다.

    나머지 $9,000만큼의 구매력은 어디로 갔을까요? 방만한 정부재정지출과 '올바른 가치저장' 역할을 수행하는 자산들을 소지한 사람들의 구매력으로 흘러들어간 것입니다. 거꾸로 이야기하면, 1971년도에 당신이 $10,000를 올바르게 투자해서 최소 구매력을 '보존'하는데는 성공했다면(부동산, 금 등의 실물자산) 현재 $100,000로 불어나 있었어야 한다는 뜻입니다.

    물론 은행에 예금해두었다면 이자를 받았겠죠. 하지만 1971년 금본위제 폐지 이래로, 2008년 양적완화를 시작한 이래로 시작된 통화가치의 절하 속도는 은행 이자로 극복할 수 있는 수준이 아닙니다. 우리가 받을 수 있는 은행금리가 중앙은행의 기준금리에 비해 매우 낮다는 것을 생각해보면 이 차이는 더더욱 벌어집니다.

    달러 정도면 그래도 잘 버티고 있는 편입니다. 우리는 이미 조선시대의 당백전, 베네수엘라, 짐바브웨, 아르헨티나, 페루, 터키, 독일 등 수많은 극심한 인플레이션 ~ 하이퍼인플레이션의 사례들을 알고 있고 이는 현재 진행형입니다.

    모든 신용화폐의 구매력은 중앙은행과 국가가 얼마나 빠른 속도로 더 찍어내는지, 신뢰를 잃는지 속도의 차이일 뿐, 장기적으로 봤을 때 반드시 그 본질적 가치인 0에 수렴합니다.

    왜 신용화폐는 끊임없이 구매력을 잃는 것일까요? 신용화폐는 실물 재화에 뒷받침받지 않는 단순한 종이, 내지는 숫자에 불과하기 때문에, 금화나 비트코인과는 달리 발행하는데 거의 아무런 노력과 에너지가 들지 않기 때문입니다.

    신용화폐의 가치가 0이 되기 전까지는, 즉 특정 사회의 사람들로부터 가치를 인정받고 있는 동안에는 발권력을 가진 기관은 반드시 마음껏 더 찍어서 '공짜 돈'을 사용하려는 욕구를 절대 거부하지 못합니다.

    사과가 10개가 있고, 화폐가 10이 있습니다. 장사꾼은 사과 1개당 1에 팔고 있었습니다. 그런데 갑자기 어디선가 화폐 10이 추가로 공급되어 총 화폐가 20이 됩니다! 이 사실을 알게 된 장사꾼이 과연 사과를 여전히 1개당 1에 팔고 싶을까요? 즉시 가격을 2로 올리게 될 것입니다.
    간단한 사실이지만, 역사는 인플레이션이 이렇게 정말 정직한 방식으로 발생한다는 것을 보여줍니다.
  `,
  }, {
  q: '비트코인은 무엇인가요? 내재가치가 있나요? 누가 가치를 보증해주나요?',
  a: `
    비트코인은 사토시 나카모토라는 익명의 그룹(으로 추측됩니다.)이 개발한 Peer-to-peer electronic cash로, 중앙은행등의 '중앙화'된 기관의 보증 없이 개인간 온라인을 돈을 직접 거래할수 있도록 하기 위해 개발된, '최초'이자 사실상 '유일하게 진정으로 탈중앙화'된 암호화폐입니다.

    심볼은 BTC이며, 이를 하드포크(비트코인 코드를 복사하여 일부 수정한 블록체인들)한 알트코인들인 BCH, BSV, BTG등과는 구분됩니다. 그리고 2009년부터 단 한번도 정지되지 않고 동작하고 있는 오리지널 블록체인입니다.

    우리가 프로그램을 다운받을 때 중앙 서버에서 다운받을 수도 있지만, 토렌트를 통해서 중앙 서버 없이 Peer-to-peer로 파일을 공유받는 방식으로 다운로드 할 수 있는 것과 비슷한 원리, 즉 전세계에 분산된 노드/채굴자들이 사용자들의 거래를 처리/검증하는 방식으로 동작합니다.

    비트코인의 작동 원리에 대해서는 컴퓨터공학 및 암호학에 대한 어느정도 이상의 지식이 필요하므로(해시, 작업증명, 블록체인, 비잔틴 장군의 문제) 관련 서적이나 일반인을 대상으로 쉽게 설명한 유튜브 영상 등을 참고하시기 바랍니다.

    '돈'에는 왜 가치가 있나요? '돈'의 가치는 본질적으로 여러 명이 구성한 사회에서 구성원들이 물물 교환을 위해서 중개물을 사용하자는 합의를 한데서 비롯됩니다. 만약 나 혼자 무인도에서 살고 있는 경우라면 '돈'에는 아무런 가치가 없을 것입니다. 물, 식품, 은신처 등 당장 사용할 수 있는 재화들에 가치가 있지요.

    다시 말해 '돈'이 얼마만큼의 가치를 갖는지는 사회적 합의에 의해 결정됩니다. '1온스의 금 = 35달러로 교환 보장'을 하던 1971년까지는, 달러의 가치가 저 합의만큼으로 고정되어 있었던 것이지요. 그러나, 닉슨이 금본위제를 깨어 약속을 무단으로 져버린 이후로부터 미국은 달러를 마음껏 발행하게 되었으며, 이 대 사기극을 인지한 시장은 달러의 평가절하를 금 값에 반영하기 시작합니다.
    그 이후로 온스당 $35이던 금은 2023년 현재 온스당 $1,920에 이르기까지 무려 50배 이상 폭등합니다. 금의 가치가 50년간 50배가 폭등한것일까요? 금 1oz = 지금도 여전히 금 1oz 일 뿐, 사실은 달러의 가치가 50분의 1로 줄어든 것입니다.
    그러나 이런 통화가치의 절하는 아주 느리게 진행되는 것처럼 보이기 때문에, 단기간에 인플레이션이 빠르게 일어나는 상황이 아니면 사람들은 서서히 구매력을 잃어갈 뿐 바로 신용화폐에 대한 신뢰를 잃어버리지는 않습니다. 마치 개구리를 따뜻한 물에서 서서히 삶는 것과 같습니다.
    그러다가 어느 임계점을 넘어 '신용화폐를 계속 들고 있으면 결국 모든 것을 잃게 된다'라는 것을 그 화폐를 사용했던 사람들이 폭발적으로 인지하기 시작하면, 신용화폐는 '신용'을 잃고 순식간에 휴지조각으로 전락하게 됩니다.
    그 시점이 정확히 언제가 될지는 알 수 없지만, 단 하나의 예외도 없이 모든 종이돈(신용화폐)은 반드시 동일한 종말을 맞이한다는 것을 역사는 보여주고 있습니다.

    비트코인은 금과 비슷합니다. 수요가 늘어난다고 공급을 맘대로 늘릴 수(찍어낼 수) 없습니다. 2022년 7월 경 우간다에서 3100만톤의 금광이 발견되었는데, 이런식으로 금은 예상치 못한 발견으로 공급량이 늘어날 수 있는 여지가 얼마든지 있습니다.
    그러나 '총 공급량 21,000,000개, 블록당 보상 50개, 4년마다 블록당 보상 절반으로 감소'라는 비트코인 프로토콜은 네트워크 참여자 다수의 합의를 거쳐 하드포크를 하지 않는 이상 절대로 바뀔 수 없습니다.

    컨센서스 없이 저 프로토콜을 고쳐서 채굴하는 채굴자가 생긴다면, 그 채굴자는 BTC가 아닌 다른 알트코인을 만들어서 채굴하게 되는 것이며(BCH, BTG, BSV...), 여전히 BTC는 전세계 모든 슈퍼컴퓨터의 연산량을 합친 것을 아득하게 초월하는 컴퓨팅 파워로 '일'(Proof-of-Work)하는 채굴자들에 의해 보안성 및 프로토콜의 불변성을 보장받습니다.
    오히려 저 엄청난 컴퓨팅 파워로 보장받는 비트코인 네트워크의 안정성과 보안성을 고려한다면, 현재 가격인 $20,000는 아직 네트워크가 충분히 성장하지 못해 제대로 평가받지 못하고 있는 매우 저렴한 가격이라고 보는게 합리적일 것입니다.
  `,
}, {
  q: '비트코인은 폰지사기 아닌가요?',
  a: `
    당신이 돈의 본질을 이해할 정도로 똑똑하다면 비트코인을 처음 접했을 때 폰지사기나 거품으로 보일 수 있습니다. '돈'의 가치는 '다른 사람들이 이것을 얼마나 원하는지'에 의해 결정되기 때문입니다.

    만약 당신이 사회로부터 고립된 무인도에 갇혀 있는 상황이라면, 달러나 금이나 비트코인 등은 당신에게 아무런 쓸모가 없을 것입니다. 그렇지만 이 경우 은신처나 낚싯대 등은 당신이 혼자이든 아니든 무인도에 갇혀있는 당신에게 엄청난 가치를 지니겠죠. 돈이 아닌 이런 물건들의 가치는 다른 사람에게 의존하지 않기 때문입니다. 그렇다면, 왜 이리도 많은 사람들이 비트코인을 돈으로서 받아들이고 갖기를 원할까요? 이는 현재 인류가 돈으로 사용해온 금, 신용화폐 등과 비교해봤을 때 '돈'으로서 비트코인이 갖는 뛰어난 특성들 때문입니다.

    <img src="https://pbs.twimg.com/media/D8thbInW4AE2ZO8?format=jpg&name=large">

    우리가 '돈'으로서 사용하는 것들은 본질적으로 여러 사람이 구성한 사회 내에서만 가치가 있습니다. 해당 사회 내에서 가치를 인정받고, 다른 사람들이 그것을 원할 때만 돈으로서 올바로 기능할 수 있습니다. 이런 점에서 비트코인에 대한 첫 인상이 폰지사기처럼 느껴지는 것은 이해할 수 있는 현상입니다.

    참고: <a href="https://twitter.com/iiicapital/status/1320373593675567104" target="_blank" style="text-decoration: underline;">@IIICapital</a>
  `,
}, {
  q: '비트코인은 어디 저장되나요?',
  a: `
    '비트코인이 저장된 하드디스크를 버린 사람이 몇 년 째 쓰레기 매립지를 뒤지고 있다'라는 뉴스 기사 등을 보면, 비트코인이 어떤 하드웨어 장치에 저장된다는 인상을 받기 쉽습니다. 금이나 현금이라면 실제 당신이 어딘가 두고 깜빡하고 그 자리를 뜬다면 다시 찾기 어렵겠죠.

    하지만 비트코인은 '어떤 주소에 얼마만큼의 잔고가 있는지'가 기록된 '블록체인'이라는 분산장부에 기록됩니다.(이해를 돕기 위해 잔고라는 표현을 사용했으나 기술적으로 엄밀히는 UTXO: Unspent Transaction Outputs 라고 합니다.) 이를테면 당신의 은행 계좌에는 사실 당신의 현금이 들어있는 것이 아니라 당신의 잔고가 숫자로 기록되어 있을 뿐인 것과 비슷합니다.

    당신이 얼마만큼의 비트코인을 갖고 있는지는, 전세계에 분산된 똑같은 장부의 카피본들에 주소 + 잔고 형식으로 기록됩니다(full-node). 그리고 당신은 당신의 비트코인 지갑에 접근할 수 있는 '개인키'만 갖고 있으면 됩니다.

    이 키는 우리가 흔히 일상생활에서 쓰는 비밀번호처럼 영문, 숫자 등을 조합하여 만든 문자열이며, 외우거나(물론 외우긴 어렵습니다) 종이에 기록해서 물리적 공간에 보관할 수 있습니다. 마치 온라인 뱅킹을 위해 은행 웹사이트에 접속하려면 비밀번호를 알고 있어야 하는 것과 동일합니다.

    이 개인키(비밀번호)만 알고 있다면, 당신이 얼마만큼의 비트코인을 갖고 있는지(사용할 수 있는지)는 전세계의 수많은 채굴자와 풀노드들이 엄청난 컴퓨팅파워로 보장해주며, 이 정보는 탈중앙화된 블록체인의 특성상 절대로 변경되지 않습니다. 마치 토렌트에서 수많은 사람이 시드를 유지하고 있는 유명한 파일들은 꽤 많은 사람들이 시드를 유지하기를 중단하더라도 계속 다운로드 가능한 것과 같습니다.

    반면에 당신이 사용중인 은행의 경우, 불미스러운 일로 데이터베이스가 공격당하거나 내부자의 범죄로 당신의 잔고가 0으로 수정되는 일이 절대 발생할 수 없다고 보장할수는 없습니다. 분명 해킹이나 인재 등의 사유로, 무시할 수 없는 확률로 일어날 수 있는 일입니다.

    당신도 이 네트워크의 불변성과 신뢰성에 기여하기를 원하시나요? 비트코인 풀노드를 다운로드 받아 실행하여 커뮤니티에 기여하실 수 있습니다!
  `,
}].map(o => ({ q: o.q, a: o.a.trim() }))