export default [{
  q: '돈은 무엇인가요? 신용화폐는 좋은 돈인가요?',
  a: `
    돈은\n1. 교환의 매개체 (medium of exchange)\n2. 가치 저장 수단 (store of value)\n3. 가치 측정 수단 (unit of account)\n입니다.

    신용화폐는 1, 3의 역할은 잘 수행하고 있지만, 2의 역할은 제대로 수행하고 있지 못합니다. 현재 인류가 가장 신뢰하고 있는 신용화폐인 달러도, 닉슨이 금본위제를 폐지한 1971년 이래로 90%의 구매력을 잃었습니다.

    <img src="https://www.visualcapitalist.com/wp-content/uploads/2021/03/Purchasing-Power-of-the-U.S.-Dollar-Over-Time.jpg">

    이는, 만약 당신이 1971년에 $10,000를 금고에 두고 지금까지 그대로 둔 상태라면, 현재 그 구매력은 그 당시 기준의 $1,000에 불과한 수준으로 줄어있다는 뜻입니다.

    나머지 $9,000만큼의 구매력은 어디로 갔을까요? 방만한 정부재정지출과 '올바른 가치저장' 역할을 수행하는 자산들을 소지한 사람들의 구매력으로 흘러들어간 것입니다. 거꾸로 이야기하면, 1971년도에 당신이 $10,000를 올바르게 투자해서 최소 구매력을 '보존'하는데는 성공했다면(부동산, 금 등의 실물자산) 현재 $100,000로 불어나 있었어야 한다는 뜻입니다.

    물론 은행에 예금해두었다면 이자를 받았겠죠. 하지만 1971년 금본위제 폐지 이래로, 2008년 양적완화를 시작한 이래로 시작된 통화가치의 절하 속도는 은행 이자로 극복할 수 있는 수준이 아닙니다. 우리가 받을 수 있는 은행금리가 중앙은행의 기준금리에 비해 매우 낮다는 것을 생각해보면 이 차이는 더더욱 벌어집니다.

    달러 정도면 그래도 잘 버티고 있는 편입니다. 우리는 이미 조선시대의 당백전, 베네수엘라, 짐바브웨, 아르헨티나, 페루, 터키, 독일 등 수많은 극심한 인플레이션 ~ 하이퍼인플레이션의 사례들을 알고 있고 이는 현재 진행형입니다.

    모든 신용화폐의 구매력은 중앙은행과 국가가 얼마나 빠른 속도로 더 찍어내는지, 신뢰를 잃는지 속도의 차이일 뿐, 장기적으로 봤을 때 반드시 그 본질적 가치인 0에 수렴합니다.

    왜 신용화폐는 끊임없이 구매력을 잃는 것일까요? 신용화폐는 실물 재화에 뒷받침받지 않는 단순한 종이, 내지는 숫자에 불과하기 때문에, 금화나 비트코인과는 달리 발행하는데 거의 아무런 노력과 에너지가 들지 않기 때문입니다.

    신용화폐의 가치가 0이 되기 전까지는, 즉 특정 사회의 사람들로부터 가치를 인정받고 있는 동안에는 발권력을 가진 기관은 반드시 마음껏 더 찍어서 '공짜 돈'을 사용하려는 욕구를 절대 거부하지 못합니다.

    사과가 10개가 있고, 화폐가 10이 있습니다. 장사꾼은 사과 1개당 1에 팔고 있었습니다. 그런데 갑자기 어디선가 화폐 10이 추가로 공급되어 총 화폐가 20이 됩니다! 이 사실을 알게 된 장사꾼이 과연 사과를 여전히 1개당 1에 팔고 싶을까요? 즉시 가격을 2로 올리게 될 것입니다.
    간단한 사실이지만, 역사는 인플레이션이 이렇게 정말 정직한 방식으로 발생한다는 것을 보여줍니다.
  `,
  }, {
  q: '비트코인은 무엇인가요? 내재가치가 있나요? 누가 가치를 보증해주나요?',
  a: `
    비트코인은 사토시 나카모토라는 익명의 그룹(으로 추측됩니다.)이 개발한 Peer-to-peer electronic cash로, 중앙은행등의 '중앙화'된 기관의 보증 없이 개인간 온라인을 돈을 직접 거래할수 있도록 하기 위해 개발된, '최초'이자 사실상 '유일하게 진정으로 탈중앙화'된 암호화폐입니다.

    심볼은 BTC이며, 이를 하드포크(비트코인 코드를 복사하여 일부 수정한 블록체인들)한 알트코인들인 BCH, BSV, BTG등과는 구분됩니다. 그리고 2009년부터 단 한번도 정지되지 않고 동작하고 있는 오리지널 블록체인입니다.

    우리가 프로그램을 다운받을 때 중앙 서버에서 다운받을 수도 있지만, 토렌트를 통해서 중앙 서버 없이 Peer-to-peer로 파일을 공유받는 방식으로 다운로드 할 수 있는 것과 비슷한 원리, 즉 전세계에 분산된 노드/채굴자들이 사용자들의 거래를 처리/검증하는 방식으로 동작합니다.

    비트코인의 작동 원리에 대해서는 컴퓨터공학 및 암호학에 대한 어느정도 이상의 지식이 필요하므로(해시, 작업증명, 블록체인, 비잔틴 장군의 문제) 관련 서적이나 일반인을 대상으로 쉽게 설명한 유튜브 영상 등을 참고하시기 바랍니다.

    '돈'에는 왜 가치가 있나요? '돈'의 가치는 본질적으로 여러 명이 구성한 사회에서 구성원들이 물물 교환을 위해서 중개물을 사용하자는 합의를 한데서 비롯됩니다. 만약 나 혼자 무인도에서 살고 있는 경우라면 '돈'에는 아무런 가치가 없을 것입니다. 물, 식품, 은신처 등 당장 사용할 수 있는 재화들에 가치가 있지요.

    다시 말해 '돈'이 얼마만큼의 가치를 갖는지는 사회적 합의에 의해 결정됩니다. '1온스의 금 = 35달러로 교환 보장'을 하던 1971년까지는, 달러의 가치가 저 합의만큼으로 고정되어 있었던 것이지요. 그러나, 닉슨이 금본위제를 깨어 약속을 무단으로 져버린 이후로부터 미국은 달러를 마음껏 발행하게 되었으며, 이 대 사기극을 인지한 시장은 달러의 평가절하를 금 값에 반영하기 시작합니다.
    그 이후로 온스당 $35이던 금은 2023년 현재 온스당 $1,920에 이르기까지 무려 50배 이상 폭등합니다. 금의 가치가 50년간 50배가 폭등한것일까요? 금 1oz = 지금도 여전히 금 1oz 일 뿐, 사실은 달러의 가치가 50분의 1로 줄어든 것입니다.
    그러나 이런 통화가치의 절하는 아주 느리게 진행되는 것처럼 보이기 때문에, 단기간에 인플레이션이 빠르게 일어나는 상황이 아니면 사람들은 서서히 구매력을 잃어갈 뿐 바로 신용화폐에 대한 신뢰를 잃어버리지는 않습니다. 마치 개구리를 따뜻한 물에서 서서히 삶는 것과 같습니다.
    그러다가 어느 임계점을 넘어 '신용화폐를 계속 들고 있으면 결국 모든 것을 잃게 된다'라는 것을 그 화폐를 사용했던 사람들이 폭발적으로 인지하기 시작하면, 신용화폐는 '신용'을 잃고 순식간에 휴지조각으로 전락하게 됩니다.
    그 시점이 정확히 언제가 될지는 알 수 없지만, 단 하나의 예외도 없이 모든 종이돈(신용화폐)은 반드시 동일한 종말을 맞이한다는 것을 역사는 보여주고 있습니다.

    비트코인은 금과 비슷합니다. 수요가 늘어난다고 공급을 맘대로 늘릴 수(찍어낼 수) 없습니다. 2022년 7월 경 우간다에서 3100만톤의 금광이 발견되었는데, 이런식으로 금은 예상치 못한 발견으로 공급량이 늘어날 수 있는 여지가 얼마든지 있습니다.
    그러나 '총 공급량 21,000,000개, 블록당 보상 50개, 4년마다 블록당 보상 절반으로 감소'라는 비트코인 프로토콜은 네트워크 참여자 다수의 합의를 거쳐 하드포크를 하지 않는 이상 절대로 바뀔 수 없습니다.

    컨센서스 없이 저 프로토콜을 고쳐서 채굴하는 채굴자가 생긴다면, 그 채굴자는 BTC가 아닌 다른 알트코인을 만들어서 채굴하게 되는 것이며(BCH, BTG, BSV...), 여전히 BTC는 전세계 모든 슈퍼컴퓨터의 연산량을 합친 것을 아득하게 초월하는 컴퓨팅 파워로 '일'(Proof-of-Work)하는 채굴자들에 의해 보안성 및 프로토콜의 불변성을 보장받습니다.
    오히려 저 엄청난 컴퓨팅 파워로 보장받는 비트코인 네트워크의 안정성과 보안성을 고려한다면, 현재 가격인 $20,000는 아직 네트워크가 충분히 성장하지 못해 제대로 평가받지 못하고 있는 매우 저렴한 가격이라고 보는게 합리적일 것입니다.
  `,
}, {
  q: '비트코인은 폰지사기 아닌가요?',
  a: `
    당신이 돈의 본질을 이해할 정도로 똑똑하다면 비트코인을 처음 접했을 때 폰지사기나 거품으로 보일 수 있습니다. '돈'의 가치는 '다른 사람들이 이것을 얼마나 원하는지'에 의해 결정되기 때문입니다.

    만약 당신이 사회로부터 고립된 무인도에 갇혀 있는 상황이라면, 달러나 금이나 비트코인 등은 당신에게 아무런 쓸모가 없을 것입니다. 그렇지만 이 경우 은신처나 낚싯대 등은 당신이 혼자이든 아니든 무인도에 갇혀있는 당신에게 엄청난 가치를 지니겠죠. 돈이 아닌 이런 물건들의 가치는 다른 사람에게 의존하지 않기 때문입니다. 그렇다면, 왜 이리도 많은 사람들이 비트코인을 돈으로서 받아들이고 갖기를 원할까요? 이는 현재 인류가 돈으로 사용해온 금, 신용화폐 등과 비교해봤을 때 '돈'으로서 비트코인이 갖는 뛰어난 특성들 때문입니다.

    <img src="https://pbs.twimg.com/media/D8thbInW4AE2ZO8?format=jpg&name=large">

    우리가 '돈'으로서 사용하는 것들은 본질적으로 여러 사람이 구성한 사회 내에서만 가치가 있습니다. 해당 사회 내에서 가치를 인정받고, 다른 사람들이 그것을 원할 때만 돈으로서 올바로 기능할 수 있습니다. 이런 점에서 비트코인에 대한 첫 인상이 폰지사기처럼 느껴지는 것은 이해할 수 있는 현상입니다.

    참고: <a href="https://twitter.com/iiicapital/status/1320373593675567104" target="_blank" style="text-decoration: underline;">@IIICapital</a>
  `,
}, {
  q: '비트코인은 어디 저장되나요?',
  a: `
    '비트코인이 저장된 하드디스크를 버린 사람이 몇 년 째 쓰레기 매립지를 뒤지고 있다'라는 뉴스 기사 등을 보면, 비트코인이 어떤 하드웨어 장치에 저장된다는 인상을 받기 쉽습니다. 금이나 현금이라면 실제 당신이 어딘가 두고 깜빡하고 그 자리를 뜬다면 다시 찾기 어렵겠죠.

    하지만 비트코인은 '어떤 주소에 얼마만큼의 잔고가 있는지'가 기록된 '블록체인'이라는 분산장부에 기록됩니다.(이해를 돕기 위해 잔고라는 표현을 사용했으나 기술적으로 엄밀히는 UTXO: Unspent Transaction Outputs 라고 합니다.) 이를테면 당신의 은행 계좌에는 사실 당신의 현금이 들어있는 것이 아니라 당신의 잔고가 숫자로 기록되어 있을 뿐인 것과 비슷합니다.

    당신이 얼마만큼의 비트코인을 갖고 있는지는, 전세계에 분산된 똑같은 장부의 카피본들에 주소 + 잔고 형식으로 기록됩니다(full-node). 그리고 당신은 당신의 비트코인 지갑에 접근할 수 있는 '개인키'만 갖고 있으면 됩니다.

    이 키는 우리가 흔히 일상생활에서 쓰는 비밀번호처럼 영문, 숫자 등을 조합하여 만든 문자열이며, 외우거나(물론 외우긴 어렵습니다) 종이에 기록해서 물리적 공간에 보관할 수 있습니다. 마치 온라인 뱅킹을 위해 은행 웹사이트에 접속하려면 비밀번호를 알고 있어야 하는 것과 동일합니다.

    이 개인키(비밀번호)만 알고 있다면, 당신이 얼마만큼의 비트코인을 갖고 있는지(사용할 수 있는지)는 전세계의 수많은 채굴자와 풀노드들이 엄청난 컴퓨팅파워로 보장해주며, 이 정보는 탈중앙화된 블록체인의 특성상 절대로 변경되지 않습니다. 마치 토렌트에서 수많은 사람이 시드를 유지하고 있는 유명한 파일들은 꽤 많은 사람들이 시드를 유지하기를 중단하더라도 계속 다운로드 가능한 것과 같습니다.

    반면에 당신이 사용중인 은행의 경우, 불미스러운 일로 데이터베이스가 공격당하거나 내부자의 범죄로 당신의 잔고가 0으로 수정되는 일이 절대 발생할 수 없다고 보장할수는 없습니다. 분명 해킹이나 인재 등의 사유로, 무시할 수 없는 확률로 일어날 수 있는 일입니다.

    당신도 이 네트워크의 불변성과 신뢰성에 기여하기를 원하시나요? 비트코인 풀노드를 다운로드 받아 실행하여 커뮤니티에 기여하실 수 있습니다!
  `,
}, {
  q: '비트코인은 더 뛰어난 이더리움 등의 다른 블록체인들에게 대체되지 않을까요?',
  a: `
    블록체인이 충분히 탈중앙화되어있고 높은 보안성을 유지하려면, 똑같은 장부가 되도록 많은 검증자들에게 복사되어야 하고 보다 많은 노드들에 의해 장부와 새 거래의 유효성이 검증되어야 합니다.
    우리가 잘 알고 있는 중앙화된 데이터베이스 기반 장부라면, 이 데이터베이스의 관리자는 쉽게 내용을 수정할 수 있고, 바로 여기서 확장성(= 거래 처리 속도)이 확보됩니다. 검증자가 적을수록, '중앙화'되어 있을수록 확장성이 뛰어난 것입니다!
    이처럼 탈중앙화를 추구한다면 확장성을 포기해야하며, 확장성을 추구한다면 탈중앙화를 포기해야 합니다.

    블록체인은
    1. 보안성 (Security)
    2. 탈중앙화 (Decentralization)
    3. 확장성 (Scalability)
    이 셋을 동시에 만족할 수 없는데, 이를 <a href="https://m.upbitcare.com/academy/education/blockchain/379" target="_blank">블록체인 트릴레마</a>라고 합니다.

    만약 '어떤 블록체인이 확장성을 만족했다'라는 말이 들린다면, 해당 블록체인은 충분히 탈중앙화되어 있지 않습니다. (비트코인을 제외한 절대다수의 알트코인들, 특히 PoW가 아닌 스마트 컨트랙트 토큰류들 (EX: ERC20...))
    어떤 장부의 사본이 적으면 적을수록 검증하기가 쉽고(소수의 검증자들이 합의하면 되니까요.), 여기서 확장성이 나오는 것인데, 이는 안타깝게도 다른 말로는 '조작하기도 쉬운' 것입니다!

    이처럼 '탈중앙화'는 태생적으로 '효율', '확장성'과는 거리가 멈에도 불구하고 진정한, 그리고 유일한 혁신인 이유가 무엇일까요? 중앙화된 기관이나 제3자를 신뢰하지 않고 토렌트처럼 탈중앙화된 시스템을 통해
    - 불변하는(immutable)
    - 되돌릴 수 없는(irreversible)
    거래를 처리할 수 있기 때문입니다. 블록체인 자체가 지닌 기술적 한계가 초래하는 비효율성에도 불과하고, 중간자를 끼지 않고 탈중앙화된 돈의 네트워크를 구성할 수 있다는, 그리고 프로토콜의 불변성이 가져다주는 장기적 가치저장수단의 탄생이라는 혁신이 가져다주는 이점이 훨씬 크기 때문에 비트코인이 이처럼 놀라운 발명인 것입니다.

    - 만약 비트코인보다 어떤 식으로든 확장성이 뛰어나며 거래속도가 빠르다는 등의 말로 마케팅하는 코인들이 있다면, 이는 중앙화된 체인이며 언제든지 소수의 의사에 의해 작동이 중단되거나 규제에 의해 거래가 금지될 위험이 매우 큰 네트워크입니다. (EX: SOL, BNB, XRP, XLM, TRX...)
    - 만약 특정 단체나 사람이 커뮤니티에서 큰 목소리를 내며 수시로 하드포크(프로토콜의 변경)를 하면서 기존 노드들의 의사를 무시한다면, 이는 중앙화된 체인이며 미등록 증권입니다. (EX: ETH)

    굳이 이런 탈중앙화되어있지도 않고 보안성과 안정성도 증명되지 못한 블록체인들을 쓰는 것이, 차라리 제도권 안에서 규제받고 있는 VISA, SWIFT등의 시스템을 사용하는 것에 비해 대체 무슨 이득이 있을까요? 결국 해당 알트코인들의 초기 주주들(CEO, VC, Devs...)의 배만 부르게 해주는 것에 불과하다는 결론에 이르게 됩니다.
  `,
}, {
  q: '비트코인은 디지털 금, 이더리움은 스마트 컨트랙트를 수행하는 탈중앙화된 월드 컴퓨터, 다른 알트코인들은 각각 나름의 역할을 하며 공존할 수 있지 않나요?',
  a: `
    비트코인은 4년마다의 반감기, 불변하는 총 공급량이 가져오는 희소성으로 인해 무한히 찍을 수 있는 신용화폐로 인한 구매력 감소를 헷징할 수 있게 해주는 수단이라는 점에서 디지털 금이라 할 수 있습니다. 오히려 '돈'으로서는 금보다 나은 점이 많습니다.

    이더리움의 스마트 컨트랙트는 분명 중앙기관 없이 여러 노드들의 합의를 통해 코드를 실행하는 혁신적인 기술이며, 전세계의 수많은 천재 개발자들이 이더리움을 위해 일하고 있는 것은 사실입니다. 그리고 기술의 가치 중립성을 지지하는 쪽이라면, 이더리움 자체에는 문제가 없다고 이야기하는 것이 맞을지도 모릅니다.

    그러나 이더리움의 스마트 컨트랙트 출범 이후로 산업군에는 어떤 일들이 일어났습니까? ERC-20, ERC-721 등의 프로토콜로 수없이 많은 무가치한 토큰들이 양산되어, 수많은 피해자들이 발생했습니다.(물론 모든 투자는 본인의 책임입니다.)

    2017년 ICO 버블, 2021년 De-Fi, NFT 버블 등을 거치며 현재는 20,000개가 넘는 현기증나게 많은 알트코인들이 존재하는데, 이 때문에 본능적으로 '낮은 시가총액'에 끌리는 성향이 있는 수많은 사람들이 진정한 혁신인 비트코인에 대해 이해하기보다는 quick money를 찾아 알트코인 펌핑 & 덤핑 도박장에 휘말리게 되었고, 이는 비트코인 채택을 방해해 왔습니다.

    2022년의 끔찍한 하락장의 원인은 역대급 금리인상기로 접어드는 거시경제 환경이 가장 큰 요인이었습니다. 다만, 하락장의 단계에서 각각의 leg-down이 진행되는데는 Luna, FTX, Celsius, 3 Arrows Capital 등의 몰락이 크게 기여했습니다.

    이들이 실패한 원인은 본질적으로 그들의 비즈니스 방식이 폰지사기였고, 무가치한 토큰을 담보물로 구성했다는데 기인합니다. 이런 토큰들은 심지어 개발자가 아닌 사람조차 쉽게 만들어낼 수 있는데, 어떤 도구가 사용되었습니까? 다름아닌 이더리움 스마트 컨트랙트 프로토콜, ERC-20입니다.

    이더리움 때문에 등장할 수 있었던 De-Fi는 본질적으로 제도권의 Ce-Fi가 수행하고 있는 역할을 '제도권 밖에서' 똑같이 수행하고 있습니다. 한마디로 은행인데, De-Fi 프로토콜에 유동성을 제공하여 이자를 받거나(= 은행예적금), 담보물을 맡기고 그 대가로 토큰들을 빌리는 것입니다.(= 대출)

    그런데 이런 금융활동이 제도권 밖에서 일어남으로 어떤 결과가 초래되었습니까? 지속가능하지 않은 비상식적인 이율을 제시하며 '스테이킹'이라고 하는 과정을 통해 유동성을 제공하도록 사람들을 유인한 뒤, 토큰의 가격이 충분히 펌핑되면 엄청난 양을 덤핑하여 러그풀을 하는 과정이 계속 반복되었습니다.

    1. $LUNA를 스테이킹하면 이자가 20%가 나온데!
    2. 너도나도 $LUNA를 사서 스테이킹 => $LUNA 가격이 하늘모르게 상승
    3. $LUNA는 중앙화되어있기 때문에, Do Kwon은 발행량을 무한으로 수정한 뒤 가격이 0에 가까워질때까지 덤핑
    4. 2에서 스테이킹해둔 사람들은 언스테이킹을 할 수가 없어 자신들이 맡겨둔 $LUNA가 휴지조각이 되는 것을 구경할 수 밖에 없었음
    5. "$LUNA 토큰 자체를 이자로서 20% 지급한다고 했지, $LUNA 자체의 가격이 유지된다곤 보장 안했다." - Do Kwon

    여기서 우리가 알 수 있는 것은,
    1. De-Fi는 소수의 개발자들에 의해 프로토콜이 변경될 수 있기 때문에 사실 'De'가 아니다.
    2. 이런 규제되지 않은 무법지대의 시스템을 이용하는 것은 은행을 이용하는 것에 비해 러그풀이나 담보물 가치 하락의 위험성을 지니고 있다.
    3. 중요한 것은 토큰의 가격과 이자가 아닌, 해당 자산군 자체의 펀더멘털을 이해하고 들어온 자본유입을 통한 시가총액의 성장이다.
    라는 점입니다.

    이더리움은, 스마트 컨트랙트를 이용한 이런 수많은 사기 행각이 일어나게 한 원죄를 갖고 있으며, 이더리움 그 자체도
    1. 72,000,000 토큰 사전채굴판매 (증권)
    2. 해킹사건이 터지자 블록체인을 특정 시점으로 되돌리며, 여기서 ETC가 갈라져나옴. (블록체인을 쓰는 본질적 이유인 '불변성', '불가역성'에 대한 위배)
    2. Ethereum Foundation / 비탈릭이라는 강력한 중앙집권 의사결정집단을 지님. (중앙화)
    3. PoW => PoS로 전환함에 따라 사실상 최소한의 탈중앙화에 대한 미련까지 버림. (토큰을 많이 가진 기득권이 토큰을 더 많이 생산할 수 있는 구조)
    4. 이더리움 투자자들은 2의 인물들이 이더리움의 가치를 올려주기를 기대함. (증권)
    이런 점들 때문에, SEC / CFTC 등에서 '미등록 증권'으로 간주하여 규제의 칼날을 빼들면 향후 운명이 어찌될지 알 수 없는 상황입니다.

    알트코인 중에서 가장 인지도가 높고 펀더멘털이 있다고 인정받는 그 이더리움의 현주소조차 이러하며, 이더리움을 제외한 절대다수의 알트코인들은 애초에 위와 같은 논의조차 불필요한 프로젝트들입니다.

    2015년 7월 등장한 이더리움 이후로 우후죽순 등장한 소위 '플랫폼' 코인들을 기반으로한 킬러 dApp이 여태까지 단 하나도 없다는 점이 소위 '블록체인 산업'의 현실입니다.

    빨리 부자가 되고 싶은 마음에 다른 무가치한 알트코인들로 눈을 돌린 수많은 사람들의 재산을 없애버렸다는 의미에서는 '킬러'가 맞다고 할 수도 있겠습니다.

    블록체인의 킬러 앱은 '장기적 가치 저장 수단으로 사용 가능한 돈' 하나 뿐이며, 이미 비트코인이 해결하고 끝난 문제입니다.

    비트코인의 제네시스 블록에는 "Chancellor on brink of second bailout for banks"(은행들의 두 번째 구제금융을 앞둔 재무장관)이라는 당시 런던 타임스지 1면의 뉴스 헤드라인이 기록되어있습니다.

    <img src="https://i.redd.it/j6ih3qdn0s701.jpg">

    비트코인은 방만한 경영으로 자본주의 논리에 의하면 도태되어야 했던 은행들을 허공에서 돈을 찍어(QE) 구제하던 모습에 대한 반대급부로, 즉 '신용화폐'에 대한 실망으로 제시된 돈입니다.

    그런데 허공에서 마음껏 토큰을 찍어낼 수 있게 해주는 프로토콜인 ERC-20을 보면 아이러니하게도 무엇이 떠오르시나요?
  `,
}, {
  q: '비트코인의 총 발행량이 21,000,000인 이유는 무엇인가요?',
  a: `
    비트코인은 210,000 블록마다 보상이 절반으로 줄어들도록 설계되어 있고, 초기 발행량은 블록당 50개였습니다.
    따라서, 발행될 코인의 총량은 다음과 같이 계산할 수 있습니다.

    50 * 210,000 = 10,500,000
    25 * 210,000 = 5,250,000
    12.5 * 210,000 = 2,625,000
    ...

    이 등비수열의 합을 모두 더하면 21,000,000이 나옵니다.

    다만 사토시가 어떻게 저 숫자를 떠올리게 되었는지는 여전히 의문입니다.

    확실한 것은, 총 발행량이 이렇게 구체적인 숫자로 제한되어 있기 때문에 무한히 찍을 수 있는 다른 코인들이나 신용화폐와는 달리 비트코인은 희소성을 갖는다는 점입니다.
  `,
}, {
  q: '비트코인의 총 발행량은 변경될 수 있나요?',
  a: `
    비트코인의 총 발행량은 변경될 수 없습니다. 비트코인의 총 발행량을 수정하여 배포하게 되면 그것은 비트코인이 아닌 새로운 코인입니다.
    심지어 전세계의 모든 채굴자들이 기적적으로 이 변경에 동의해서 전부 다 총 발행량이 변경된 '새로운' 비트코인을 채굴하게 된다 하더라도, 그것은 여전히 비트코인이 아닙니다.
    그리고 여전히 그 하드포크가 일어나기 전의 장부와 채굴 프로그램(진짜 비트코인)은 그대로 남아있고, 누군가는 다시 이렇게 변경되지 않은 원래의 코인을 언제든 채굴해서 비트코인의 오리지널리티를 이어나갈 수 있습니다.

    비트코인의 가치는 비트코인의 성능이나 기능보다는 비트코인이 갖고있는 희소성과, 그것이 변경 불가능하다는 사실에서 옵니다.
    물론 비트코인에도 버그가 존재할 수 있으며, 전체 네트워크의 보안성과 프로토콜을 훼손할 심각한 버그가 발견된다면 이는 수정되어야 하며, 개발자 & 채굴자 커뮤니티는 아마 그에 동의하고 하드포크를 진행할 것입니다.

    그러나 이런 불가피한 경우가 아니라 단지 비트코인의 블록 크기를 늘리거나, 생성 주기를 변경하는 등 프로토콜 변경을 위한 하드포크를 하는 것은 비트코인의 가치를 훼손하며, 철저히 차단되어야 할 것입니다.

    이를테면 BCH, BSV, BTG 등 수많은 비트코인의 하드포크(스캠)들이 자신이 '더 나은 비트코인이다'라고 우기며 그 복사를 진행한 집단의 이득을 위해 비트코인의 불변성을 훼손하려 시도해 왔습니다.

    고무적이게도 2018년 해시전쟁에서 비트코인은 저런 내러티브를 들고 나온 도전자들에게 해시파워를 크게 빼앗기지 않았고, 오늘날까지도 끝없는 해시파워의 상승을 보이며 오리지널은 단 하나 뿐임을 증명하고 있습니다.

    <img src="https://pbs.twimg.com/media/FKtRrM1UUAUbE_f?format=jpg&name=large">

    이 수많은 비트코인의 모조품들에 투자하는 사람들을 보고 해주고 싶은 말은 단 하나 뿐입니다. "또 속냐?"
  `,
}, {
  q: '하드포크 / 소프트포크는 무엇인가요?',
  a: `
    기본적으로 둘 다 소프트웨어 업데이트를 말합니다. 차이는 다음과 같습니다.

    - 소프트포크: SegWit, Taproot, Schnorr, Lightning Network 등의 <b>기존의 프로토콜과 호환되는</b> 코드 변경이 들어가있음. 채굴자들은 이 업그레이드가 적용된 프로그램으로 채굴하든 기존의 프로그램으로 채굴하든 상관없음. (체인분리 없음)
    - 하드포크: 블록 크기 변경, 블록 생성 주기 변경, 총 발행량 변경 등 <b>기존의 프로토콜과 호환되지 않는</b> 코드 변경이 들어가있어서, 하드포크가 시작된 블록부터는 이 변경된 채굴 프로그램을 다운받은 채굴자들끼리 새로운 체인을 형성함. (체인분리)

    따라서 소프트포크의 경우 업데이트된 버전과 기존 버전이 네트워크에 공존할 수 있는 업데이트입니다.(업데이트하고 싶은 채굴자만 업데이트해도 됨.)
    그러나 하드포크의 경우는 업데이트된 버전은 기존 버전과 호환되지 않아 같은 네트워크에 공존할 수 없습니다.(업데이트를 한 채굴자들끼리 새로운 체인을 형성함.)

    토렌트를 비유로 예로 들어 조금 더 쉽게 설명해보겠습니다.

    - 소프트포크: 기존의 토렌트 프로그램을 사용하던 사람들은 새로운 버전의 토렌트 프로그램을 사용하더라도 기존에 다운받던 파일을 계속 다운받을 수 있습니다.(기존 받던 파일에 이어서 다운로드됨.)
    - 하드포크: 기존의 토렌트 프로그램을 사용하던 사람들은 새로운 버전의 토렌트 프로그램을 사용해야만 새로운 토렌트 파일을 다운받을 수 있습니다.(기존에 받던 파일은 호환되지 않아 새로 다운로드해야함.)

    이처럼 하드포크는 기존의 소프트웨어와 호환되지 않는 과격한 변화를 강행하는 업데이트이며, 하드포크는 기존의 소프트웨어와 호환되는 업데이트입니다.

    만약 비트코인이 이더리움처럼 프로토콜에 변경을 가하는 하드포크를(etc, merge, shanghai...) 수시로 진행해왔다면 결코 이렇게 빠른 속도로 성장하지 못했을 것입니다.

    어떤 체인이 하드포크를 진행한다며 '호재다'라고 하는 말을 들으신 적이 있나요?
    네, 해당 체인은 그처럼 소수의 결정으로 쉽게 하드포크를 진행할 수 있는, 언제든 프로토콜(규칙)이 밥먹든 바뀔 수 있는 중앙화된 체인이라고 이해하시면 됩니다.
  `,
}].map(o => ({ q: o.q, a: o.a.trim() }))